step-0: sync slice to croadfeldt HEAD
Signed-off-by: Chris Roadfeldt <chris@roadfeldt.com>
